In [1]:
from env import host, user, password

get_db_url = f'mysql+pymysql://{user}:{password}@{host}/employees'

In [2]:
import pandas as pd

In [3]:
import numpy as np

Use your function to obtain a connection to the employees database.

In [4]:
pd.read_sql('SELECT * FROM employees', get_db_url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [5]:
pd.read_sql('SELECT * FROM employeez', get_db_url)

###tells me that employeez doe not exist

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.employeez' doesn't exist")
[SQL: SELECT * FROM employeez]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
pd.read_sql('SELECT cats FROM employees', get_db_url)

##tells me that the collum does not exist

Read the employees and titles tables into two separate DataFrames.

In [ ]:
sql_employees = pd.read_sql('SELECT * FROM employees.employees', get_db_url)

In [8]:
sql_titles = pd.read_sql('SELECT * FROM employees.titles', get_db_url)

How many rows and columns do you have in each DataFrame? Is that what you expected?

for the employees there are 300.024 rows and 6 collums 

for the titles there are 443 308

yes that is expected unelees i did this wrong

Display the summary statistics for each DataFrame.

#.describe ?

In [ ]:
sql_employees.describe()

In [9]:
sql_titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

How many unique titles are in the titles DataFrame?

In [10]:
sql_titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

What is the oldest date in the to_date column?

#is going to be the 1985-03-01

In [ ]:
sql_titles.sort_values(by= 'to_date')

What is the most recent date in the to_date column?

most recent would be the currently employed 9999- 01-01

In [ ]:
############################################################################################

In [11]:
from pydataset import data

In [12]:
np.random.seed(123)

In [13]:
students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [14]:

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [15]:
df

       name  math  english  reading classroom
0     Sally    62       85       80         A
1      Jane    88       79       67         B
2     Suzie    94       74       95         A
3     Billy    98       96       88         B
4       Ada    77       92       98         A
5      John    79       76       93         B
6    Thomas    82       64       81         A
7     Marie    93       63       90         A
8    Albert    92       62       87         A
9   Richard    69       80       94         A
10    Isaac    92       99       93         B
11     Alan    92       62       72         A

Copy the users and roles DataFrames from the examples above.

In [ ]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

In [ ]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

What is the result of using a right join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='right')

What is the result of using an outer join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='outer')

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
user_drop = users.drop(columns=['role_id'])

In [ ]:
rol_drop = roles.drop(columns=['id'])

In [ ]:
#user_drop.merge(rol_drop, left_on='role_id', right_on='id', how='inner')

In [ ]:
#after dropping it it did not want to merge by the same criteria again

Output and read the documentation for the mpg dataset.

In [16]:
 data('mpg', show_doc=True) # view the documentation for the dataset
mpg = data('mpg') # load the dataset and store it in a variable

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [17]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

How many rows and columns are in the dataset?

In [ ]:
mpg.shape

Check out your column names and perform any cleanup you may want on them.

In [24]:
mpg = mpg.rename(columns={'cty': 'city'})

In [25]:
mpg = mpg.rename(columns={'hwy': 'highway'})

In [27]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

Display the summary statistics for the dataset.

In [ ]:
mpg.describe()

How many different manufacturers are there?

In [44]:
mpg.manufacturer.value_counts()

dodge         37
toyota        34
volkswagen    27
ford          25
chevrolet     19
audi          18
hyundai       14
subaru        14
nissan        13
honda          9
jeep           8
pontiac        5
land rover     4
mercury        4
lincoln        3
Name: manufacturer, dtype: int64

How many different models are there?

In [45]:
mpg.model.value_counts()

caravan 2wd               11
ram 1500 pickup 4wd       10
civic                      9
jetta                      9
dakota pickup 4wd          9
mustang                    9
impreza awd                8
a4 quattro                 8
grand cherokee 4wd         8
a4                         7
toyota tacoma 4wd          7
camry solara               7
camry                      7
tiburon                    7
sonata                     7
passat                     7
f150 pickup 4wd            7
durango 4wd                7
explorer 4wd               6
new beetle                 6
altima                     6
4runner 4wd                6
forester awd               6
gti                        5
c1500 suburban 2wd         5
corolla                    5
corvette                   5
malibu                     5
grand prix                 5
k1500 tahoe 4wd            4
pathfinder 4wd             4
mountaineer 4wd            4
range rover                4
maxima                     3
navigator 2wd              3
a6 quattro                 3
expedition 2wd             3
land cruiser wagon 4wd     2
Name: model, dtype: int64

Create a column named mileage_difference like you did in the DataFrames exercises; 

this column should contain the difference between highway and city mileage for each car.

In [28]:
mpg['mileage_difference'] = mpg.highway-mpg.city
mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [29]:
mpg['average_mileage'] = mpg.city + mpg.highway / 2

mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,32.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,35.5
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,35.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,36.0
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,29.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,33.0
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,35.5
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,29.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,31.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,30.0

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [36]:
mpg['is_automatic '] = mpg.trans.str.startswith('a')

mpg

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,32.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,35.5,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,35.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,36.0,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,29.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,33.0,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,35.5,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,29.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,31.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,30.0,True

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [30]:
mpg.average_mileage.nsmallest()

55     15.0
60     15.0
66     15.0
70     15.0
127    15.0
Name: average_mileage, dtype: float64

In [39]:
mpg.groupby('manufacturer')[['average_mileage']]

In [43]:
mpg.groupby('manufacturer').average_mileage.min().sort_values(ascending=False).head(1)

manufacturer
honda    35.5
Name: average_mileage, dtype: float64

Do automatic or manual cars have better miles per gallon?

In [32]:
mpg.groupby('trans')['average_mileage'].agg(['min'])

             min
trans
auto(av)    31.5
auto(l3)    30.0
auto(l4)    18.0
auto(l5)    15.0
auto(l6)    21.0
auto(s4)    28.5
auto(s5)    21.0
auto(s6)    21.0
manual(m5)  19.0
manual(m6)  15.0

In [ ]:
###################################################################################

Use your get_db_url function to help you explore the data from the chipotle database.

In [52]:
orders = pd.read_sql('SELECT * FROM orders', get_db_url)
orders

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

In [66]:
orders.info()

## im guessing for the first question i should convert the item price to an integer

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  4622 non-null   int64
 1   order_id            4622 non-null   int64
 2   quantity            4622 non-null   int64
 3   item_name           4622 non-null   object
 4   choice_description  4622 non-null   object
 5   item_price          4622 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 216.8+ KB

What is the total price for each order?

In [69]:

#orders['item_price'] = orders.item_price.str.replace('$', '')

In [70]:
order_totals = orders.groupby('order_id').item_price.sum()
order_totals

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

What are the most popular 3 items?

In [83]:
orders.groupby('item_name').sum().sort_values(by= 'quantity', ascending=False).head(3)

                          id  order_id  quantity  item_price
item_name
Chicken Bowl         1780635    713926       761     7342.73
Chicken Burrito      1238770    497303       591     5575.82
Chips and Guacamole  1122252    449959       506     2201.04

Which item has produced the most revenue?

In [86]:
orders.groupby('item_name').sum().sort_values(by= 'item_price',ascending=False).head(1)

                   id  order_id  quantity  item_price
item_name
Chicken Bowl  1780635    713926       761     7342.73

Join the employees and titles DataFrames together.

In [90]:
employees = pd.read_sql('SELECT * FROM employees JOIN titles using (emp_no)', get_db_url)

For each title, find the hire date of the employee that was hired most recently with that title.

In [92]:
employees.groupby('hire_date').max().sort_values(by= 'hire_date',ascending=False).head(1)

,emp_no,birth_date,first_name,last_name,gender,title,from_date,to_date
hire_date,,,,,,,,
2000-01-28,463807,1964-06-12,Bikash,Covnot,M,Engineer,2000-02-01,2000-05-19

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [7]:
dept_title_query = '''

                    SELECT t.emp_no, 
                    t.title, 
                    t.from_date, 
                    t.to_date, 
                    d.dept_name 
                    FROM departments AS d 
                    JOIN dept_emp AS de USING(dept_no) 
                    JOIN titles AS t USING(emp_no);

                    '''

In [8]:
dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))

TypeError: 'str' object is not callable